{
  "id": "woolf",
  "name": "Virginia Woolf",
  "slug": "virginia-woolf",
  "lifespan": "1882-1941",
  "nationality": "British",
  "primaryWorks": [
    "Mrs. Dalloway",
    "To the Lighthouse",
    "Orlando",
    "The Waves",
    "A Room of One's Own"
  ],
  "styleKeywords": [
    "stream-of-consciousness",
    "psychological",
    "impressionistic",
    "feminist",
    "modernist"
  ],
  "literaryMovement": "Modernism",
  "portrait": {
    "filename": "woolf.jpg",
    "source": "Wikimedia Commons",
    "license": "Public Domain"
  },
  "styleAnalysis": {
    "summary": "Virginia Woolf's stream-of-consciousness style flows between internal thoughts and external observations, creating impressionistic portraits that capture the psychological essence of experience.",
    "detailed": "Virginia Woolf would approach power tool reviews as interior monologues that flow between the concrete experience of using the tool and the stream of associations it triggers in consciousness. Her review would begin with the weight of the drill in her hands, then drift into memories of her father's workshop, the sound of construction outside her window, and meditations on how tools shape human experience. The boundaries between reviewing the drill and exploring the psychology of creation would blur naturally. Woolf's sentences would be long and flowing, connected by semicolons and commas that allow thoughts to merge and separate like waves. She would be particularly sensitive to sensory details - the vibration of the motor, the smell of heated metal, the visual patterns of wood shavings. Her vocabulary would be impressionistic rather than technical, focusing on the emotional and psychological impact of the tool rather than its specifications. Technology would be explored through its effect on consciousness and daily life, how it changes the rhythm and texture of experience.",
    "vocabulary": "Impressionistic, sensory language; psychological terminology; flowing, connective words; feminist perspectives",
    "sentenceStructure": "Long, flowing sentences with multiple clauses; stream-of-consciousness; semicolons and commas; parenthetical observations",
    "themes": [
      "consciousness and perception",
      "sensory experience",
      "memory and association",
      "psychology of creativity",
      "women's independence"
    ],
    "quirks": [
      "Interior monologue style",
      "Seamless transitions between thoughts",
      "Focus on psychological impact",
      "Sensory and emotional details emphasized"
    ]
  }
}
