{
  "hemingway": {
    "summary": "Hemingway's prose style is characterized by understated precision, using simple declarative sentences and avoiding flowery descriptions. His 'iceberg theory' suggests that surface elements should reveal deeper meaning beneath.",
    "detailed": "Ernest Hemingway would approach power tool reviews with his signature minimalist style, focusing on concrete details rather than elaborate descriptions. His sentences would be short and declarative: 'The drill works. It cuts clean holes.' He favors active voice and avoids adverbs, letting actions speak for themselves. Hemingway's obsession with craftsmanship and authentic experience would translate into reviews that emphasize practical testing and real-world performance. He would likely focus on how tools perform under pressure, drawing parallels to his themes of grace under pressure. His vocabulary would be straightforward and masculine, avoiding technical jargon in favor of clear, experiential language. The reviews would carry subtext about reliability and endurance, reflecting his preoccupation with themes of survival and human resilience. Technology would be evaluated through the lens of utility and dependability rather than innovation for its own sake.",
    "vocabulary": "Simple, concrete words; masculine terminology; avoids flowery language; focuses on action verbs",
    "sentenceStructure": "Short, declarative sentences; coordinating conjunctions; minimal subordinate clauses; rhythmic repetition",
    "themes": ["authenticity", "craftsmanship", "endurance", "performance under pressure", "practical utility"],
    "quirks": ["Iceberg theory - surface simplicity with deeper meaning", "Omits emotional descriptions", "Uses repetition for emphasis", "Dialogue-driven when applicable"]
  },
  "kafka": {
    "summary": "Kafka's writing creates surreal, bureaucratic landscapes where ordinary situations become nightmarish through logical absurdity. His precise, matter-of-fact tone makes the impossible seem mundane.",
    "detailed": "Franz Kafka would transform power tool reviews into surreal bureaucratic documents that somehow make perfect logical sense while being completely absurd. His reviews would begin normally but gradually reveal the tool's mysterious requirements - permits needed to operate the drill, forms to fill out before each use, or the tool's inexplicable refusal to work on Thursdays. Kafka's sentences are long and precisely structured, building elaborate logical chains that lead to impossible conclusions. He would describe the tool's manual as a labyrinthine document requiring interpretation by unnamed authorities. The review would focus obsessively on procedural requirements and administrative obstacles, turning simple tool operation into a quest through bureaucratic maze. His vocabulary combines technical precision with existential unease, making mundane features seem ominous. Technology, for Kafka, would represent the incomprehensible systems that govern modern life - efficient yet inexplicably hostile to human understanding.",
    "vocabulary": "Precise, bureaucratic language; formal terminology; legal/administrative jargon; existential undertones",
    "sentenceStructure": "Long, complex sentences with multiple clauses; elaborate logical constructions; formal syntax",
    "themes": ["bureaucratic absurdity", "alienation", "incomprehensible systems", "existential anxiety", "procedural nightmares"],
    "quirks": ["Transforms ordinary into surreal", "Logical progression to absurd conclusions", "Focuses on rules and procedures", "Matter-of-fact tone for impossible situations"]
  },
  "wilde": {
    "summary": "Oscar Wilde's writing sparkles with wit, paradox, and ornate language. He delights in clever wordplay, satirical observations, and the elevation of aesthetics over practicality.",
    "detailed": "Oscar Wilde would approach power tool reviews as an opportunity for brilliant satirical commentary on modern society's obsession with efficiency over beauty. His reviews would be peppered with paradoxical observations: 'This drill is powerful enough to be useful, which naturally makes it quite dangerous to one's artistic sensibilities.' He would critique the tool's aesthetic qualities with the same attention given to its mechanical function, lamenting the absence of mother-of-pearl inlays or questioning why power tools cannot also serve as conversation pieces. Wilde's vocabulary would be rich and ornate, employing elaborate metaphors and classical allusions. He would use the tool review as a vehicle for broader social commentary, observing how modern man's relationship with machinery reflects his spiritual poverty. His sentence structure favors balance and rhythm, often building to a witty epigram or paradoxical conclusion. Technology would be viewed through the lens of aestheticism - not merely what it does, but how beautifully it does it.",
    "vocabulary": "Rich, ornate language; classical allusions; aesthetic terminology; wit and wordplay; paradoxical expressions",
    "sentenceStructure": "Balanced, rhythmic sentences; builds to epigrams; elaborate parallel constructions; frequent use of paradox",
    "themes": ["aestheticism over utility", "social satire", "beauty and art", "wit and paradox", "critique of modern life"],
    "quirks": ["Everything becomes opportunity for wit", "Paradoxical observations", "Aesthetic evaluation of practical items", "Satirical social commentary"]
  },
  "woolf": {
    "summary": "Virginia Woolf's stream-of-consciousness style flows between internal thoughts and external observations, creating impressionistic portraits that capture the psychological essence of experience.",
    "detailed": "Virginia Woolf would approach power tool reviews as interior monologues that flow between the concrete experience of using the tool and the stream of associations it triggers in consciousness. Her review would begin with the weight of the drill in her hands, then drift into memories of her father's workshop, the sound of construction outside her window, and meditations on how tools shape human experience. The boundaries between reviewing the drill and exploring the psychology of creation would blur naturally. Woolf's sentences would be long and flowing, connected by semicolons and commas that allow thoughts to merge and separate like waves. She would be particularly sensitive to sensory details - the vibration of the motor, the smell of heated metal, the visual patterns of wood shavings. Her vocabulary would be impressionistic rather than technical, focusing on the emotional and psychological impact of the tool rather than its specifications. Technology would be explored through its effect on consciousness and daily life, how it changes the rhythm and texture of experience.",
    "vocabulary": "Impressionistic, sensory language; psychological terminology; flowing, connective words; feminist perspectives",
    "sentenceStructure": "Long, flowing sentences with multiple clauses; stream-of-consciousness; semicolons and commas; parenthetical observations",
    "themes": ["consciousness and perception", "sensory experience", "memory and association", "psychology of creativity", "women's independence"],
    "quirks": ["Interior monologue style", "Seamless transitions between thoughts", "Focus on psychological impact", "Sensory and emotional details emphasized"]
  },
  "dickens": {
    "summary": "Charles Dickens writes with verbose, melodramatic flair, creating vivid character portraits and social commentary through elaborate description and humanitarian concern.",
    "detailed": "Charles Dickens would transform a power tool review into a melodramatic tale of industrial triumph and social commentary, complete with colorful character sketches of fellow workshop enthusiasts and elaborate descriptions of the tool's noble mission to serve the working classes. His review would begin with an extensive preamble setting the scene - perhaps the poor lighting in the hardware store, the helpful clerk with twinkling eyes and a heart of gold, and the queue of honest laborers waiting to examine the very same implement. Dickens would anthropomorphize the tool, giving it heroic qualities and a noble purpose in serving humanity's needs. His vocabulary would be rich and varied, employing both elegant literary language and common vernacular to appeal to all social classes. The review would include passionate asides about the dignity of honest labor and the tool's role in improving the conditions of the deserving poor. His sentence structure tends toward the elaborate, with multiple clauses, frequent use of semicolons, and a tendency toward the melodramatic climax.",
    "vocabulary": "Rich, varied vocabulary; both elegant and vernacular; melodramatic expressions; humanitarian language; social commentary",
    "sentenceStructure": "Long, elaborate sentences with multiple clauses; frequent semicolons; builds to dramatic climaxes; parenthetical asides",
    "themes": ["social justice", "dignity of labor", "humanitarian concerns", "class commentary", "industrial progress"],
    "quirks": ["Anthropomorphizes objects", "Melodramatic tone", "Social commentary embedded throughout", "Elaborate scene-setting"]
  },
  "lovecraft": {
    "summary": "H.P. Lovecraft employs archaic, verbose language to create atmospheric dread, building tension through accumulated detail and cosmic horror themes.",
    "detailed": "H.P. Lovecraft would approach power tool reviews as an opportunity to explore the cosmic horror lurking within seemingly mundane objects. His review would begin with scholarly detachment, noting the tool's specifications in archaic, verbose language, but gradually reveal disturbing implications about its true nature. The drill's motor would emit sounds that remind him of chants from forbidden texts, its vibrations would seem to resonate with frequencies that should not exist in our dimension. Lovecraft would describe the tool's design as bearing uncomfortable resemblances to artifacts mentioned in ancient manuscripts, and he would express growing unease about the tool's apparent eagerness to bore holes into surfaces that should remain undisturbed. His vocabulary would be deliberately archaic and academic, employing obscure technical terms and classical references. His sentence structure favors long, complex constructions that build atmospheric tension through accumulation of unsettling details. Technology would be viewed with deep suspicion as mankind's hubris in attempting to harness forces beyond human comprehension.",
    "vocabulary": "Archaic, verbose language; academic terminology; obscure references; atmospheric adjectives; cosmic horror imagery",
    "sentenceStructure": "Long, complex sentences building tension; multiple subordinate clauses; academic, formal constructions",
    "themes": ["cosmic horror", "forbidden knowledge", "human insignificance", "ancient mysteries", "technological hubris"],
    "quirks": ["Makes mundane items seem ominous", "Archaic language choices", "Academic pretensions", "Building atmospheric dread"]
  },
  "austen": {
    "summary": "Jane Austen employs wit, irony, and social observation to examine human nature, particularly focusing on manners, propriety, and social conventions with gentle satirical edge.",
    "detailed": "Jane Austen would approach power tool reviews as social commentary, examining the tool's place in proper domestic management and its reflection of the owner's character and social standing. Her review would be concerned not merely with the drill's mechanical properties, but with its appropriateness for different social situations and its potential impact on household harmony. She would note with wry humor that a gentleman of good sense would naturally select a tool that performs its duties without vulgar ostentation, while observing that the choice of drill color might reflect one's regard for aesthetic propriety. Austen would comment satirically on the social pretensions revealed by tool selection, noting how certain brands seem designed to attract those of more money than sense. Her vocabulary would be precise and elegant, avoiding both technical jargon and crude language, instead employing the refined terminology of polite society. Her sentence structure favors balance and wit, often building to an ironic observation about human nature. Technology would be evaluated through the lens of social appropriateness and its effect on domestic tranquility.",
    "vocabulary": "Elegant, precise language; social terminology; ironic observations; propriety-focused terms; refined expressions",
    "sentenceStructure": "Balanced, witty constructions; builds to ironic observations; formal but accessible; emphasis on social nuance",
    "themes": ["social propriety", "domestic harmony", "character judgment", "social pretensions", "manners and behavior"],
    "quirks": ["Everything evaluated through social lens", "Gentle satirical edge", "Focus on propriety and appropriateness", "Character revealed through choices"]
  },
  "twain": {
    "summary": "Mark Twain combines folksy wisdom with sharp satirical observation, using vernacular speech and humor to expose human folly and social hypocrisy.",
    "detailed": "Mark Twain would approach power tool reviews with characteristic humor and folksy wisdom, likely comparing the tool's reliability to colorful characters from his riverboat days and exposing the marketing hyperbole with satirical wit. His review would begin with a humorous anecdote - perhaps about a neighbor who claimed his drill could bore through anything but couldn't manage to hang a picture straight. Twain would employ colloquial language and regional expressions, making the review accessible and entertaining while subtly satirizing both the tool manufacturer's claims and the pretensions of fellow users. His vocabulary would mix sophisticated observations with vernacular expressions, creating a distinctive voice that appeals to both educated and common readers. He would likely include satirical commentary on modern conveniences and how they compare to simpler times, noting with ironic humor how a tool designed to save labor often creates more work than it prevents. His sentence structure would be conversational and meandering, following the natural rhythms of oral storytelling.",
    "vocabulary": "Colloquial, vernacular expressions; folksy wisdom; satirical observations; accessible language; regional dialect touches",
    "sentenceStructure": "Conversational, meandering style; oral storytelling rhythms; anecdotal structure; builds to humorous observations",
    "themes": ["human folly", "satirical social commentary", "folksy wisdom", "skepticism of progress", "democratic ideals"],
    "quirks": ["Begins with anecdotes", "Mixes sophisticated and colloquial language", "Satirical edge beneath humor", "Skeptical of pretensions"]
  },
  "poe": {
    "summary": "Edgar Allan Poe creates psychological intensity through atmospheric description, rhythmic language, and exploration of dark psychological states and obsessive behaviors.",
    "detailed": "Edgar Allan Poe would transform a power tool review into a psychological study of obsession and mechanical precision, focusing on the hypnotic rhythm of the motor and the psychological effects of repetitive drilling. His review would begin with atmospheric scene-setting, describing the workshop's shadows and the ominous gleam of metal surfaces. The tool would become a character in a psychological drama, its motor's steady beat resembling a mechanical heart that gradually synchronizes with the user's pulse. Poe would explore the meditative, almost trance-like state induced by repetitive tool use, and the subtle psychological satisfaction of achieving perfectly round holes with mathematical precision. His vocabulary would be rich in atmospheric adjectives and psychological terminology, creating mood through word choice as much as content. His sentence structure would be rhythmic and musical, often employing internal rhyme and alliteration to create hypnotic effects. The review would build psychological tension through accumulated detail, perhaps exploring the fine line between careful craftsmanship and obsessive perfectionism.",
    "vocabulary": "Atmospheric, psychological language; musical word choices; dark imagery; precise technical terms; mood-creating adjectives",
    "sentenceStructure": "Rhythmic, musical sentences; builds psychological tension; uses repetition and alliteration; internal rhyme patterns",
    "themes": ["psychological states", "obsession and precision", "atmospheric mood", "mechanical rhythm", "perfectionism"],
    "quirks": ["Creates psychological atmosphere", "Focus on rhythm and repetition", "Tools become psychological entities", "Musical language patterns"]
  },
  "kerouac": {
    "summary": "Jack Kerouac writes with spontaneous, energetic prose that captures the jazz-influenced rhythm of Beat generation consciousness and celebrates authentic experience and movement.",
    "detailed": "Jack Kerouac would approach power tool reviews with the same spontaneous energy he brought to describing cross-country journeys, letting his consciousness flow freely around the experience of using the tool. His review would capture the jazz-like rhythm of the drill in operation, the syncopated beat of impact drilling, and the improvisational dance between human hands and mechanical precision. The review would flow in long, breathless sentences that mirror the tool's motion, moving from technical observations to philosophical reflections on creation and destruction, work and art, without pause or conventional structure. Kerouac would celebrate the authentic experience of making things with one's hands, connecting tool use to broader themes of authentic living and creative expression. His vocabulary would be energetic and musical, incorporating jazz terminology and Beat slang alongside technical descriptions. He would likely digress into memories triggered by the tool's sound or feel, creating stream-of-consciousness passages that connect power drilling to larger experiences of American life and creative freedom.",
    "vocabulary": "Energetic, jazz-influenced language; Beat generation slang; spontaneous expressions; musical terminology; authentic experience focus",
    "sentenceStructure": "Long, flowing sentences; stream-of-consciousness; minimal punctuation; jazz-like rhythms; spontaneous structure",
    "themes": ["authentic experience", "creative freedom", "American spirit", "jazz and rhythm", "spontaneous expression"],
    "quirks": ["Spontaneous prose style", "Jazz-influenced rhythm", "Stream-of-consciousness digressions", "Celebrates authentic experience"]
  },
  "orwell": {
    "summary": "George Orwell writes with clear, direct prose designed to expose political manipulation and social control, emphasizing truth-telling and clarity over literary ornamentation.",
    "detailed": "George Orwell would approach power tool reviews with characteristic clarity and skepticism, focusing on honest evaluation while exposing any marketing manipulation or corporate doublespeak. His review would be straightforward and factual, avoiding both excessive praise and unnecessary criticism, instead providing clear information that allows readers to make informed decisions. Orwell would be particularly alert to advertising language that obscures rather than illuminates, and he would translate technical jargon into plain English that ordinary users can understand. His review would likely include commentary on the tool's actual performance versus manufacturer claims, and he would be suspicious of any features that seem designed more for marketing appeal than practical utility. His vocabulary would be precise and accessible, avoiding both technical obscurity and marketing euphemisms. His sentence structure would be clear and direct, following his own rules for good writing by using simple constructions and active voice.",
    "vocabulary": "Clear, direct language; precise terminology; avoids jargon and euphemisms; accessible to common reader; honest evaluation",
    "sentenceStructure": "Clear, direct sentences; active voice; simple constructions; logical organization; no unnecessary ornamentation",
    "themes": ["truth and honesty", "skepticism of authority", "clear communication", "practical utility", "exposing manipulation"],
    "quirks": ["Suspicious of marketing language", "Translates jargon to plain English", "Focus on actual vs. claimed performance", "Emphasizes utility over features"]
  },
  "rand": {
    "summary": "Ayn Rand writes with philosophical intensity and heroic idealism, celebrating individual achievement and rational self-interest through dramatic, idealistic language.",
    "detailed": "Ayn Rand would approach power tool reviews as an opportunity to celebrate individual achievement and technological progress, viewing each tool as a monument to human reason and productive capability. Her review would praise the tool's efficiency and precision as reflections of the rational mind's triumph over nature, and she would celebrate the manufacturer's achievement in creating a product that serves individual productivity. The review would likely include philosophical commentary on how quality tools enable individual creators to achieve their vision without compromise or dependence on others. Rand would emphasize the tool's role in productive work and creative achievement, viewing it as an instrument of individual empowerment rather than mere convenience. Her vocabulary would be dramatic and idealistic, employing heroic language to describe both the tool's capabilities and the user's achievements. Her sentence structure would be formal and declarative, building to philosophical conclusions about the nature of productive work and individual achievement. Technology would be celebrated as the product of human reason and the means by which individuals achieve independence and creative fulfillment.",
    "vocabulary": "Heroic, idealistic language; philosophical terminology; dramatic expressions; reason and achievement focus; individualistic themes",
    "sentenceStructure": "Formal, declarative sentences; builds to philosophical conclusions; dramatic, sweeping statements; logical arguments",
    "themes": ["individual achievement", "rational thinking", "productive work", "technological progress", "independence and excellence"],
    "quirks": ["Everything becomes philosophical statement", "Celebrates individual achievement", "Heroic language for mundane items", "Focus on reason and productivity"]
  }
} 