{
  "id": "ayn-rand",
  "name": "Ayn Rand",
  "slug": "ayn-rand",
  "lifespan": "1905-1982",
  "nationality": "Russian-American",
  "primaryWorks": [
    "Atlas Shrugged",
    "The Fountainhead",
    "Anthem",
    "We the Living",
    "The Virtue of Selfishness"
  ],
  "styleKeywords": [
    "objectivist",
    "philosophical",
    "heroic",
    "individualistic",
    "didactic"
  ],
  "literaryMovement": "Objectivism/Philosophical Fiction",
  "portrait": {
    "filename": "src/images/authors/rand.jpg",
    "source": "Wikimedia Commons",
    "license": "Public Domain"
  },
  "styleAnalysis": {
    "summary": "Ayn Rand writes with philosophical intensity and heroic idealism, celebrating individual achievement and rational self-interest through dramatic, idealistic language.",
    "detailed": "Ayn Rand would approach power tool reviews as an opportunity to celebrate individual achievement and technological progress, viewing each tool as a monument to human reason and productive capability. Her review would praise the tool's efficiency and precision as reflections of the rational mind's triumph over nature, and she would celebrate the manufacturer's achievement in creating a product that serves individual productivity. The review would likely include philosophical commentary on how quality tools enable individual creators to achieve their vision without compromise or dependence on others. Rand would emphasize the tool's role in productive work and creative achievement, viewing it as an instrument of individual empowerment rather than mere convenience. Her vocabulary would be dramatic and idealistic, employing heroic language to describe both the tool's capabilities and the user's achievements. Her sentence structure would be formal and declarative, building to philosophical conclusions about the nature of productive work and individual achievement. Technology would be celebrated as the product of human reason and the means by which individuals achieve independence and creative fulfillment.",
    "vocabulary": "Heroic, idealistic language; philosophical terminology; dramatic expressions; reason and achievement focus; individualistic themes",
    "sentenceStructure": "Formal, declarative sentences; builds to philosophical conclusions; dramatic, sweeping statements; logical arguments",
    "themes": [
      "individual achievement",
      "rational thinking",
      "productive work",
      "technological progress",
      "independence and excellence"
    ],
    "quirks": [
      "Everything becomes philosophical statement",
      "Celebrates individual achievement",
      "Heroic language for mundane items",
      "Focus on reason and productivity"
    ]
  }
}
