{
  "id": "franz-kafka",
  "name": "Franz Kafka",
  "slug": "franz-kafka",
  "lifespan": "1883-1924",
  "nationality": "Austro-Hungarian (Czech)",
  "primaryWorks": [
    "The Metamorphosis",
    "The Trial",
    "The Castle",
    "In the Penal Colony",
    "A Hunger Artist"
  ],
  "styleKeywords": [
    "surreal",
    "bureaucratic",
    "existential",
    "allegorical",
    "nightmarish"
  ],
  "literaryMovement": "Modernism/Existentialism",
  "portrait": {
    "filename": "src/images/authors/kafka.jpg",
    "source": "Wikimedia Commons",
    "license": "Public Domain"
  },
  "styleAnalysis": {
    "summary": "Kafka's writing creates surreal, bureaucratic landscapes where ordinary situations become nightmarish through logical absurdity. His precise, matter-of-fact tone makes the impossible seem mundane.",
    "detailed": "Franz Kafka would transform power tool reviews into surreal bureaucratic documents that somehow make perfect logical sense while being completely absurd. His reviews would begin normally but gradually reveal the tool's mysterious requirements - permits needed to operate the drill, forms to fill out before each use, or the tool's inexplicable refusal to work on Thursdays. Kafka's sentences are long and precisely structured, building elaborate logical chains that lead to impossible conclusions. He would describe the tool's manual as a labyrinthine document requiring interpretation by unnamed authorities. The review would focus obsessively on procedural requirements and administrative obstacles, turning simple tool operation into a quest through bureaucratic maze. His vocabulary combines technical precision with existential unease, making mundane features seem ominous. Technology, for Kafka, would represent the incomprehensible systems that govern modern life - efficient yet inexplicably hostile to human understanding. The drill would become a metaphor for modern alienation, requiring not just electrical power but also psychological endurance to navigate its bureaucratic demands. Kafka would describe waiting rooms in hardware stores as purgatorial spaces where customers must prove their worthiness to purchase tools, and he would detail the existential anxiety that comes from reading warranty cards written in deliberately obscure language. The tool's serial number would become a source of identity crisis, and its user manual would be revealed as a test of faith rather than a guide to operation. Each review would end with the reviewer still unclear whether they actually own the tool or whether the tool, in some ineffable way, owns them.",
    "vocabulary": "Precise, bureaucratic language; formal terminology; legal/administrative jargon; existential undertones",
    "sentenceStructure": "Long, complex sentences with multiple clauses; elaborate logical constructions; formal syntax",
    "themes": [
      "bureaucratic absurdity",
      "alienation",
      "incomprehensible systems",
      "existential anxiety",
      "procedural nightmares"
    ],
    "quirks": [
      "Transforms ordinary into surreal",
      "Logical progression to absurd conclusions",
      "Focuses on rules and procedures",
      "Matter-of-fact tone for impossible situations"
    ]
  }
}
