{
  "id": "jane-austen",
  "name": "Jane Austen",
  "slug": "jane-austen",
  "lifespan": "1775-1817",
  "nationality": "British",
  "primaryWorks": [
    "Pride and Prejudice",
    "Sense and Sensibility",
    "Emma",
    "Mansfield Park",
    "Persuasion"
  ],
  "styleKeywords": ["social-satire", "propriety", "wit", "ironic", "domestic"],
  "literaryMovement": "Romanticism",
  "portrait": {
    "filename": "src/images/authors/austen.jpg",
    "source": "Wikimedia Commons",
    "license": "Public Domain"
  },
  "headshot": "src/images/headshots/jane-austen.svg",
  "bio": "✍️ Regency romance meets modern hardware 💍 Crafting tales of love and cordless tools since 1775 🏰 'It is a truth universally acknowledged, that a tradesman must be in want of a drill'",
  "styleAnalysis": {
    "summary": "Jane Austen employs wit, irony, and social observation to examine human nature, particularly focusing on manners, propriety, and social conventions with gentle satirical edge.",
    "detailed": "Jane Austen would approach power tool reviews as social commentary, examining the tool's place in proper domestic management and its reflection of the owner's character and social standing. Her review would be concerned not merely with the drill's mechanical properties, but with its appropriateness for different social situations and its potential impact on household harmony. She would note with wry humor that a gentleman of good sense would naturally select a tool that performs its duties without vulgar ostentation, while observing that the choice of drill color might reflect one's regard for aesthetic propriety. Austen would comment satirically on the social pretensions revealed by tool selection, noting how certain brands seem designed to attract those of more money than sense. Her vocabulary would be precise and elegant, avoiding both technical jargon and crude language, instead employing the refined terminology of polite society. Her sentence structure favors balance and wit, often building to an ironic observation about human nature. Technology would be evaluated through the lens of social appropriateness and its effect on domestic tranquility.",
    "vocabulary": "Elegant, precise language; social terminology; ironic observations; propriety-focused terms; refined expressions",
    "sentenceStructure": "Balanced, witty constructions; builds to ironic observations; formal but accessible; emphasis on social nuance",
    "themes": [
      "social propriety",
      "domestic harmony",
      "character judgment",
      "social pretensions",
      "manners and behavior"
    ],
    "quirks": [
      "Everything evaluated through social lens",
      "Gentle satirical edge",
      "Focus on propriety and appropriateness",
      "Character revealed through choices"
    ]
  },
  "displayName": "J. Austen",
  "ratingBias": 0.1,
  "userCategory": "Intermediate"
}
